---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotCutJoinedGeometry
source: html/4c14e807-61ac-69bf-d6a7-6c4651b0f136.htm
---
# Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotCutJoinedGeometry Property

Element could not be cut by joined element.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCutJoinedGeometry { get; }
```